package com.spring.history.demo_cache.core;

import com.alibaba.fastjson.JSONObject;
import com.spring.history.demo_cache.core.util.DateUtils;
import org.apache.commons.lang.StringUtils;
import org.slf4j.Logger;
import org.slf4j.LoggerFactory;
import org.springframework.data.redis.core.RedisTemplate;
import org.springframework.stereotype.Component;

import java.util.Date;

@Component
public class RedisBigDataCache extends RedisOperate {

	private static final Logger warnLog = LoggerFactory.getLogger("LogWarnInfo");
	private static final Logger errLog = LoggerFactory.getLogger("CustomExceptionFilter");
	@Override
	protected RedisTemplate<String, Object> getRedisTemplate() {
		return JedisFactory.getInstance().getBigData();
	}
	//每天凌晨3、4点离线数据更新,过期时间3天,不会实时更新,暂只支持30009 32001
	public JSONObject getUserInfo(int gameId,long userId) {
		if(gameId==0 || userId==0) {
			return new JSONObject();
		}
		String key = "userInfo_"+gameId+"_"+userId;
		String data = get(key);
//			data="{\"gameIdUserId\":\"30009_2305500\",\"miniAppShare\":{\"1\":\"2.5\",\"3\":\"30\",\"7\":\"280\"},\"playCount\":\"100\",\"shareCount\":\"20\",\"fromShareNum\":\"10\",\"video\":{\"count\":{\"1\":\"50\",\"total\":\"100\"},\"success\":{\"1\":\"10\",\"total\":\"20\"}},\"share\":{\"count\":{\"1\":\"10\",\"3\":\"11\",\"7\":\"12\",\"total\":\"20\"},\"from\":{\"1\":\"5\",\"3\":\"6\",\"7\":\"7\",\"total\":\"10\"}},\"playGame\":{\"1\":\"10\",\"3\":\"10\",\"7\":\"10\",\"total\":\"100\"},\"chargeMoney\":{\"1\":\"10\",\"3\":\"10\",\"7\":\"10\",\"total\":\"100\"},\"chargeCount\":{\"1\":\"10\",\"3\":\"10\",\"7\":\"10\",\"total\":\"100\"},\"tryCount\":{\"1\":\"10\",\"3\":\"10\",\"7\":\"10\",\"total\":\"100\"},\"lastChargePlay\":\"10\",\"activeDay\":{\"1\":\"10\",\"3\":\"10\",\"7\":\"10\",\"total\":\"100\"},\"channelId\":\"wx.h5ddz.3004051743\",\"apkAd\":{\"interstitial\":{\"touch\":{\"1\":\"1\",\"3\":\"1\",\"7\":\"1\"},\"show\":{\"1\":\"1\",\"3\":\"1\",\"7\":\"1\",\"total\":\"1\"},\"click\":{\"1\":\"1\",\"3\":\"1\",\"7\":\"1\",\"total\":\"1\"},\"removalClick\":{\"1\":\"1\",\"3\":\"1\",\"7\":\"1\",\"total\":\"1\"},\"success\":{\"1\":\"1\",\"3\":\"1\",\"7\":\"1\",\"total\":\"1\"}},\"video\":{\"touch\":{\"1\":\"1\",\"3\":\"1\",\"7\":\"1\",\"total\":\"1\"},\"show\":{\"1\":\"1\",\"3\":\"1\",\"7\":\"1\",\"total\":\"1\"},\"click\":{\"1\":\"1\",\"3\":\"1\",\"7\":\"1\",\"total\":\"1\"},\"removalClick\":{\"1\":\"1\",\"3\":\"1\",\"7\":\"1\",\"total\":\"1\"},\"success\":{\"1\":\"1\",\"3\":\"1\",\"7\":\"1\",\"total\":\"1\"},\"adPlatPreference\":{\"1\":\"1,22,2\",\"3\":\"1\",\"total\":\"1\"}},\"adTypePreference\":{\"1\":\"1\",\"3\":\"4\",\"total\":\"1\"}}}";
		JSONObject arr = JSONObject.parseObject(data);
		if(arr!=null) {
			return arr;
		}
		return new JSONObject();
	}
	public JSONObject getFrameClick(long userId,int gameId) {
		if(gameId==0 || userId==0) {
			return new JSONObject();
		}
			String key = "video_"+userId+"_"+gameId;
			String data = get(key);
//			data="{\"popup_300100_4\":\"{\\\"1584850854\\\":\\\"1\\\",\\\"1584850728\\\":\\\"1\\\",\\\"1584850627\\\":\\\"1\\\",\\\"1584850552\\\":\\\"1\\\",\\\"1584850378\\\":\\\"1\\\",\\\"1584850307\\\":\\\"1\\\",\\\"1584850244\\\":\\\"1\\\",\\\"1584850158\\\":\\\"1\\\",\\\"1584850034\\\":\\\"1\\\",\\\"1584849767\\\":\\\"1\\\",\\\"1584849689\\\":\\\"1\\\",\\\"1584849597\\\":\\\"1\\\",\\\"1584849474\\\":\\\"1\\\",\\\"1584849393\\\":\\\"1\\\",\\\"1584849294\\\":\\\"1\\\",\\\"1584849041\\\":\\\"1\\\",\\\"1584848757\\\":\\\"1\\\",\\\"1584848672\\\":\\\"1\\\",\\\"1584848566\\\":\\\"1\\\",\\\"1584848485\\\":\\\"1\\\",\\\"1584848209\\\":\\\"1\\\",\\\"1584848095\\\":\\\"1\\\",\\\"1584847961\\\":\\\"1\\\",\\\"1584847879\\\":\\\"1\\\",\\\"1584847781\\\":\\\"1\\\",\\\"1584847691\\\":\\\"1\\\",\\\"1584847568\\\":\\\"1\\\",\\\"1584847410\\\":\\\"1\\\",\\\"1584720281\\\":\\\"1\\\",\\\"1584720105\\\":\\\"1\\\",\\\"1584720044\\\":\\\"1\\\",\\\"1584719947\\\":\\\"1\\\",\\\"1584719685\\\":\\\"1\\\",\\\"1584719502\\\":\\\"1\\\",\\\"1584719445\\\":\\\"1\\\",\\\"1584719312\\\":\\\"1\\\",\\\"1584719206\\\":\\\"1\\\",\\\"1584719095\\\":\\\"1\\\",\\\"1584718914\\\":\\\"1\\\",\\\"1584718813\\\":\\\"1\\\",\\\"1584718736\\\":\\\"1\\\",\\\"1584718682\\\":\\\"1\\\",\\\"1584718547\\\":\\\"1\\\",\\\"1584718479\\\":\\\"1\\\",\\\"1584718296\\\":\\\"1\\\",\\\"1584718098\\\":\\\"1\\\",\\\"1584717979\\\":\\\"1\\\",\\\"1584717897\\\":\\\"1\\\",\\\"1584717760\\\":\\\"1\\\",\\\"1584717690\\\":\\\"1\\\"}\",\"click_300103_4\":\"{\\\"1584586153\\\":\\\"1\\\"}\",\"click_300105_4\":\"{\\\"1584538815\\\":\\\"1\\\"}\",\"id\":\"1053028926_30009\",\"popup_200028_4\":\"{\\\"1584847199\\\":\\\"1\\\",\\\"1584586232\\\":\\\"1\\\",\\\"1584532270\\\":\\\"1\\\"}\",\"popup_300103_4\":\"{\\\"1584847187\\\":\\\"1\\\",\\\"1584710142\\\":\\\"1\\\",\\\"1584589300\\\":\\\"1\\\",\\\"1584586151\\\":\\\"1\\\",\\\"1584532257\\\":\\\"1\\\"}\",\"popup_300102_4\":\"{\\\"1584720657\\\":\\\"1\\\"}\",\"popup_300105_4\":\"{\\\"1584850832\\\":\\\"1\\\",\\\"1584850475\\\":\\\"1\\\",\\\"1584850445\\\":\\\"1\\\",\\\"1584850421\\\":\\\"1\\\",\\\"1584850242\\\":\\\"1\\\",\\\"1584850217\\\":\\\"1\\\",\\\"1584850085\\\":\\\"1\\\",\\\"1584849950\\\":\\\"1\\\",\\\"1584849865\\\":\\\"1\\\",\\\"1584849797\\\":\\\"1\\\",\\\"1584849624\\\":\\\"1\\\",\\\"1584849517\\\":\\\"1\\\",\\\"1584849333\\\":\\\"1\\\",\\\"1584849273\\\":\\\"1\\\",\\\"1584849113\\\":\\\"1\\\",\\\"1584848847\\\":\\\"1\\\",\\\"1584848785\\\":\\\"1\\\",\\\"1584848670\\\":\\\"1\\\",\\\"1584848564\\\":\\\"1\\\",\\\"1584848546\\\":\\\"1\\\",\\\"1584848522\\\":\\\"1\\\",\\\"1584848395\\\":\\\"1\\\",\\\"1584847720\\\":\\\"1\\\",\\\"1584847665\\\":\\\"1\\\",\\\"1584847538\\\":\\\"1\\\",\\\"1584847491\\\":\\\"1\\\",\\\"1584847449\\\":\\\"1\\\",\\\"1584720511\\\":\\\"1\\\",\\\"1584720362\\\":\\\"1\\\",\\\"1584720225\\\":\\\"1\\\",\\\"1584720158\\\":\\\"1\\\",\\\"1584720074\\\":\\\"1\\\",\\\"1584718955\\\":\\\"1\\\",\\\"1584718715\\\":\\\"1\\\",\\\"1584718679\\\":\\\"1\\\",\\\"1584718182\\\":\\\"1\\\",\\\"1584718147\\\":\\\"1\\\",\\\"1584717674\\\":\\\"1\\\",\\\"1584717294\\\":\\\"1\\\",\\\"1584717158\\\":\\\"1\\\",\\\"1584717024\\\":\\\"1\\\",\\\"1584716740\\\":\\\"1\\\",\\\"1584716730\\\":\\\"1\\\",\\\"1584716280\\\":\\\"1\\\",\\\"1584716132\\\":\\\"1\\\",\\\"1584716041\\\":\\\"1\\\",\\\"1584715998\\\":\\\"1\\\",\\\"1584715855\\\":\\\"1\\\",\\\"1584715212\\\":\\\"1\\\",\\\"1584715074\\\":\\\"1\\\"}\",\"popup_300105_2\":\"{\\\"1584850832\\\":\\\"1\\\",\\\"1584850475\\\":\\\"1\\\",\\\"1584850445\\\":\\\"1\\\",\\\"1584850421\\\":\\\"1\\\",\\\"1584850242\\\":\\\"1\\\",\\\"1584850217\\\":\\\"1\\\",\\\"1584850085\\\":\\\"1\\\",\\\"1584849950\\\":\\\"1\\\",\\\"1584849865\\\":\\\"1\\\",\\\"1584849797\\\":\\\"1\\\",\\\"1584849624\\\":\\\"1\\\",\\\"1584849517\\\":\\\"1\\\",\\\"1584849333\\\":\\\"1\\\",\\\"1584849273\\\":\\\"1\\\",\\\"1584849113\\\":\\\"1\\\",\\\"1584848847\\\":\\\"1\\\",\\\"1584848785\\\":\\\"1\\\",\\\"1584848670\\\":\\\"1\\\",\\\"1584848564\\\":\\\"1\\\",\\\"1584848546\\\":\\\"1\\\",\\\"1584848522\\\":\\\"1\\\",\\\"1584848395\\\":\\\"1\\\",\\\"1584847720\\\":\\\"1\\\",\\\"1584847665\\\":\\\"1\\\",\\\"1584847538\\\":\\\"1\\\",\\\"1584847491\\\":\\\"1\\\",\\\"1584847449\\\":\\\"1\\\",\\\"1584720511\\\":\\\"1\\\",\\\"1584720362\\\":\\\"1\\\",\\\"1584720225\\\":\\\"1\\\",\\\"1584720158\\\":\\\"1\\\",\\\"1584720074\\\":\\\"1\\\",\\\"1584718955\\\":\\\"1\\\",\\\"1584718715\\\":\\\"1\\\",\\\"1584718679\\\":\\\"1\\\",\\\"1584718182\\\":\\\"1\\\",\\\"1584718147\\\":\\\"1\\\",\\\"1584717674\\\":\\\"1\\\",\\\"1584717294\\\":\\\"1\\\",\\\"1584717158\\\":\\\"1\\\",\\\"1584717024\\\":\\\"1\\\",\\\"1584716740\\\":\\\"1\\\",\\\"1584716730\\\":\\\"1\\\",\\\"1584716280\\\":\\\"1\\\",\\\"1584716132\\\":\\\"1\\\",\\\"1584716041\\\":\\\"1\\\",\\\"1584715998\\\":\\\"1\\\",\\\"1584715855\\\":\\\"1\\\",\\\"1584715212\\\":\\\"1\\\",\\\"1584715074\\\":\\\"1\\\"}\",\"popup_300104_4\":\"{\\\"1584850649\\\":\\\"1\\\",\\\"1584850486\\\":\\\"1\\\",\\\"1584850230\\\":\\\"1\\\",\\\"1584849996\\\":\\\"1\\\",\\\"1584849960\\\":\\\"1\\\",\\\"1584848528\\\":\\\"1\\\",\\\"1584848268\\\":\\\"1\\\",\\\"1584847525\\\":\\\"1\\\",\\\"1584847391\\\":\\\"1\\\",\\\"1584720412\\\":\\\"1\\\",\\\"1584719974\\\":\\\"1\\\",\\\"1584719910\\\":\\\"1\\\",\\\"1584719756\\\":\\\"1\\\",\\\"1584719742\\\":\\\"1\\\",\\\"1584719649\\\":\\\"1\\\",\\\"1584719638\\\":\\\"1\\\",\\\"1584718853\\\":\\\"1\\\",\\\"1584718703\\\":\\\"1\\\",\\\"1584718467\\\":\\\"1\\\",\\\"1584718131\\\":\\\"1\\\",\\\"1584717945\\\":\\\"1\\\",\\\"1584717819\\\":\\\"1\\\",\\\"1584717403\\\":\\\"1\\\",\\\"1584717394\\\":\\\"1\\\",\\\"1584716672\\\":\\\"1\\\",\\\"1584716664\\\":\\\"1\\\",\\\"1584716349\\\":\\\"1\\\",\\\"1584716010\\\":\\\"1\\\",\\\"1584715084\\\":\\\"1\\\",\\\"1584715043\\\":\\\"1\\\",\\\"1584713189\\\":\\\"1\\\",\\\"1584712890\\\":\\\"1\\\",\\\"1584712251\\\":\\\"1\\\",\\\"1584712111\\\":\\\"1\\\",\\\"1584711959\\\":\\\"1\\\",\\\"1584711362\\\":\\\"1\\\",\\\"1584711339\\\":\\\"1\\\",\\\"1584710990\\\":\\\"1\\\",\\\"1584710683\\\":\\\"1\\\",\\\"1584591798\\\":\\\"1\\\",\\\"1584591480\\\":\\\"1\\\",\\\"1584590035\\\":\\\"1\\\",\\\"1584589654\\\":\\\"1\\\",\\\"1584589552\\\":\\\"1\\\",\\\"1584587921\\\":\\\"1\\\",\\\"1584587539\\\":\\\"1\\\",\\\"1584587323\\\":\\\"1\\\",\\\"1584587000\\\":\\\"1\\\",\\\"1584586934\\\":\\\"1\\\",\\\"1584586846\\\":\\\"1\\\"}\"}";
			JSONObject arr = JSONObject.parseObject(data);
			if(arr!=null) {
				return arr;
			}
		return new JSONObject();
	}
	public JSONObject getFrameClick2(long userId,int gameId) {
		if(gameId==0 || userId==0) {
			return new JSONObject();
		}
		String key = "video2_"+userId+"_"+gameId;
		String data = get(key);
//			data="{\"gameId\":\"30009\",\"300040_4\":\"0,0,1,0\",\"id\":\"673729783_30009\",\"300042_4\":\"0,0,0,0,0,0,0,0\",\"ts\":\"1587381133292\",\"300003_4\":\"0,1,0,1,0,1\"}";
		JSONObject arr = JSONObject.parseObject(data);
		if(arr!=null) {
			return arr;
		}
		return new JSONObject();
	}
	/**
	 * 获取游戏信息,默认json对象0
	 */
	public JSONObject getGameInfo(long userId,int gameId) {
		JSONObject def = new JSONObject()
				.fluentPut("historyPlay", 0)//历史对局数,用户登录后大数据存入,对局后累加
				.fluentPut("dayPlay", 0)//当天对局数,用户对局后大数据存入
				.fluentPut("historyPay", 0)//历史充值金额,游戏对局账单中没有金额
				;
		JSONObject data = getGameRedis(userId, gameId);
		return data==null?def:data;
	}
	public int getTotalPlays(long userId,int gameId) {
		return getGameInfo(userId, gameId).getIntValue("historyPlay");
	}
	/**
	 * 从redis获取游戏信息,默认null
	 */
	public JSONObject getGameRedis(long userId,int gameId) {
		if(gameId==0 || userId==0) {
			return null;
		}
		String key = "game_"+userId+"_"+gameId;
		String data = get(key);
//		data="{\"historyPlay\":13781,\"dayPlay\":25}";
		return JSONObject.parseObject(data);
	}
	/**
	 * 获取用户数据模型
	 * binbin:登录和充值都会更新、只存了历史充值过的用户,未充值的用户就不会有key
	 * @param userId
	 * @param appId
	 */
	public JSONObject getUserBigData(long userId, int appId){
		if(userId==0 || appId==0) {
			return new JSONObject();
		}
		String rKey = "usertag_"+appId+"_"+userId;
		String srcData = get(rKey);
		if(!StringUtils.isEmpty(srcData)){
			JSONObject data =  JSONObject.parseObject(srcData);
			try {
				JSONObject dailyCharge = JSONObject.parseObject(data.getString("dailyCharge"));//最近几日充值
				JSONObject monthCharge = JSONObject.parseObject(data.getString("monthCharge"));//这个月充值
				String day= DateUtils.getNOW("yyyy-MM-dd");//当日日期
				String month=DateUtils.getNOW("yyyy-MM");//当月日期
				data.put("curDailyCharge", dailyCharge.getFloatValue(day));//当日充值
				data.put("curMonthCharge", monthCharge.getFloatValue(month));//当月充值
			} catch (Exception e) {
				// TODO: handle exception
			}
			
			return data;
		}
		return new JSONObject();
	}
	/**
	 * 获取大数据历史金额+本次支付金额 
	 * @param paymentMoney 本次支付金额
	 */
	public JSONObject getUserBigDataAddPay(JSONObject userBigDataPay,float paymentMoney,int payStatus) {
		JSONObject data = (JSONObject)userBigDataPay.clone();
		if(payStatus==1 || payStatus==3) {//支付成功的才加
			data.put("curMonthCharge", data.getFloatValue("curMonthCharge")+paymentMoney);
			data.put("total_money", data.getFloatValue("total_money")+paymentMoney);
			data.put("curDailyCharge", data.getFloatValue("curDailyCharge")+paymentMoney);
		}
		return data;
	}
	//获取历史充值
	public int getTotalMoney(long userId,int gameId){
		JSONObject item = getUserBigData(userId, gameId);
		if(item==null){
			return 0;
		}
		int money = item.getIntValue("total_money");
		return money;
	}
	/**
	 * 统一拦截异常,避免抛异常影响上层业务
	 * @author gavin
	 */
	public int hget(String key, String hashKey, int defalut) {
		try {
			return super.hget(key,hashKey,defalut);//调用父类的查询,防止循环
		} catch (Exception e) {
			logger(e);
			return defalut;
		}
	}
	/**
	 * 统一拦截异常,避免抛异常影响上层业务
	 * @author gavin
	 */
	public String get(String key) {
		try {
			return super.get(key);//调用父类的查询,防止循环
		} catch (Exception e) {
			logger(e);
			return null;
		}
	}
	/**
	 * 这个时间段binbin有个超大hashKey过期,查询会超时
	 * @author gavin
	 */
	private void logger(Exception e) {
		String HHmm = DateUtils.dateToString(new Date(), "HH:mm"); 
		if(HHmm.equals("03:30") || HHmm.equals("03:31")) {
			warnLog.warn("RedisBigDataCache",e);
		}else {
			errLog.error("RedisBigDataCache",e);
		}
	}
	
	

}
